Tekla.Structures.Drawing.BaseLineWithArrowAtEndPointPlacingType
The BaseLineWithArrowAtEndPointPlacingType class defines a
placing type that places the object using the base line placing.
The line is drawn and will have an arrow at the end point.

Tekla.Structures.Drawing.BaseLineWithArrowAtEndPointPlacingType.#ctor
Creates a new base line with arrow at end point placing type instance.